[
    {
        "text": "ЭТИ люди, в обход всех правил, 28 октября 1941 года отправили письмо Уинстону Черчиллю. Напишите (на английском) фамилию того из НИХ, кто изобрёл машину.",
        "answer": {
            "text": "turing"
        },
        "fuzzy": true
    },

    {
        "text": "В июле 2001 года на ЭТОМ мероприятии был арестован российский программист. Найдите логин в Twitter человека, который основал ЭТО мероприятие.",
        "answer": {
            "text": "thedarktangent"
        },
        "fuzzy": true
    },

    {
        "text": "ЭТО исследование, вышедшее в 1970-х годах, помогло решить проблему передачи ключей по открытым каналам. Назовите авторов ЭТОГО исследования.",
        "answer": {
            "variants": [
                {
                    "text": "Rivest, Shamir, Adleman"
                },
                {
                    "text": "Diffie, Hellman",
                    "correct": true
                },
                {
                    "text": "Rijmen, Daemen"
                },
                {
                    "text": "Koblitz, Miller"
                }
            ],
            "shuffle": true
        }
    },

    {
        "text": "ЭТУ компьютерную программу, запущенную в 1988 году, в определённых кругах прозвали Великой. Напишите название сетевого сервиса, отладочный режим которого ОНА использовала.",
        "answer": {
            "text": "sendmail"
        },
        "fuzzy": true
    },

    {
        "text": "Среди громких уязвимостей последних лет именно ЭТИ две атаки направлены на чтение чужой памяти через сторонний канал. Из НИХ выберите ту атаку, которая хуже работает на AMD.",
        "answer": {
            "text": "meltdown"
        },
        "fuzzy": true
    },

    {
        "text": "Сейчас ЭТОТ человек занимается беспилотными автомобилями, но в его послужном списке есть взломы устройств Sony и Apple. Вспомните название программы, которую ОН написал, работая в Google Project Zero.",
        "answer": {
            "text": "qira"
        },
        "fuzzy": true
    },

    {
        "text": "Одного из авторов ЭТОГО шифра связывают с изобретением дифференциального криптоанализа. Назовите того, кто предложил атаку на ЭТОТ шифр, использующую миллион сообщений.",
        "answer": {
            "variants": [
                {
                    "text": "Dan Boneh"
                },
                {
                    "text": "Don Coppersmith"
                },
                {
                    "text": "Michael J. Wiener"
                },
                {
                    "text": "Daniel Bleichenbacher",
                    "correct": true
                }
            ]
        },
        "shuffle": true
    },

    {
        "text": "Известно, что за десять тысяч ЭТИХ были куплены две пиццы с доставкой. Напишите номер года, в котором был опубликован файл, описывающий работу ЭТИХ.",
        "answer": {
            "text": "2008"
        }
    },

    {
        "text": "ЭТОТ человек вошёл в топ-100 знаменитых финнов всех времён. Напишите (на английском) фамилию профессора, с которым ЭТОТ человек спорил в 1992 году.",
        "answer": {
            "text": "tanenbaum"
        },
        "fuzzy": true
    },

    {
        "text": "Одним из первых ЭТОТ человек опубликовал исследование об эксплуатации переполнения буфера на куче. Напишите ЕГО фамилию на русском языке.",
        "answer": {
            "text": "песляк"
        },
        "fuzzy": true
    }
]
